import numpy as np
import matplotlib.pyplot as plt

# логарифмическая функция потерь
def loss(w, x, y):
    M = np.dot(w, x.T) * y
    return np.log2(1 + np.exp(-M))


# производная логарифмической функции потерь по вектору w
def df(w, x, y):
    M = np.dot(w, x.T) * y
    return -(np.exp(-M) * x.T * y) / ((1 + np.exp(-M)) * np.log(2))


data_x = np.array([(5.3, 2.3), (5.7, 2.5), (4.0, 1.0), (5.6, 2.4), (4.5, 1.5),
                   (5.4, 2.3), (4.8, 1.8), (4.5, 1.5), (5.1, 1.5), (6.1, 2.3),
                   (5.1, 1.9), (4.0, 1.2), (5.2, 2.0), (3.9, 1.4), (4.2, 1.2),
                   (4.7, 1.5), (4.8, 1.8), (3.6, 1.3), (4.6, 1.4), (4.5, 1.7),
                   (3.0, 1.1), (4.3, 1.3), (4.5, 1.3), (5.5, 2.1), (3.5, 1.0),
                   (5.6, 2.2), (4.2, 1.5), (5.8, 1.8), (5.5, 1.8), (5.7, 2.3),
                   (6.4, 2.0), (5.0, 1.7), (6.7, 2.0), (4.0, 1.3), (4.4, 1.4),
                   (4.5, 1.5), (5.6, 2.4), (5.8, 1.6), (4.6, 1.3), (4.1, 1.3),
                   (5.1, 2.3), (5.2, 2.3), (5.6, 1.4), (5.1, 1.8), (4.9, 1.5),
                   (6.7, 2.2), (4.4, 1.3), (3.9, 1.1), (6.3, 1.8), (6.0, 1.8),
                   (4.5, 1.6), (6.6, 2.1), (4.1, 1.3), (4.5, 1.5), (6.1, 2.5),
                   (4.1, 1.0), (4.4, 1.2), (5.4, 2.1), (5.0, 1.5), (5.0, 2.0),
                   (4.9, 1.5), (5.9, 2.1), (4.3, 1.3), (4.0, 1.3), (4.9, 2.0),
                   (4.9, 1.8), (4.0, 1.3), (5.5, 1.8), (3.7, 1.0), (6.9, 2.3),
                   (5.7, 2.1), (5.3, 1.9), (4.4, 1.4), (5.6, 1.8), (3.3, 1.0),
                   (4.8, 1.8), (6.0, 2.5), (5.9, 2.3), (4.9, 1.8), (3.3, 1.0),
                   (3.9, 1.2), (5.6, 2.1), (5.8, 2.2), (3.8, 1.1), (3.5, 1.0),
                   (4.5, 1.5), (5.1, 1.9), (4.7, 1.4), (5.1, 1.6), (5.1, 2.0),
                   (4.8, 1.4), (5.0, 1.9), (5.1, 2.4), (4.6, 1.5), (6.1, 1.9),
                   (4.7, 1.6), (4.7, 1.4), (4.7, 1.2), (4.2, 1.3), (4.2, 1.3)])
data_y = np.array([1, 1, -1, 1, -1, 1, 1, -1, 1, 1, 1, -1, 1, -1, -1, -1, -1,
                   -1, -1, 1, -1, -1, -1, 1, -1, 1, -1, 1, 1, 1, 1, -1, 1, -1,
                   -1, -1, 1, 1, -1, -1, 1, 1, 1, 1, -1, 1, -1, -1, 1, 1, -1, 1,
                   -1, -1, 1, -1, -1, 1, 1, 1, -1, 1, -1, -1, 1, 1, -1, 1, -1,
                   1, 1, 1, -1, 1, -1, 1, 1, 1, 1, -1, -1, 1, 1, -1, -1, -1, 1,
                   -1, -1, 1, -1, 1, 1, -1, 1, -1, -1, -1, -1, -1])

X_train = np.array([[1, x[0], x[1]] for x in data_x])
y_train = data_y

n_train = len(X_train) # размер обучающей выборки
w = [0.0, 0.0, 0.0] # начальные весовые коэффициенты
nt = np.array([0.1, 0.05, 0.05]) # шаг обучения для каждого параметра w0, w1, w2
lm = 0.01 # значение параметра лямбда для вычисления EMA
N = 200 # число итераций алгоритма SGD
batch_size = 10 # размер мини-батча (величина K = 10)

alpha = 0.7 # параметр для RMSProp
G = np.zeros(len(w)) # параметр для RMSProp
eps = 0.01 # параметр для RMSProp

# здесь расчет идет через функцию потерь, а не через скобки Айверсона - 
# иначе задание не принимается
Qe = loss(w, X_train, y_train).mean()
np.random.seed(0)

for i in range(N):
    # индекс случайного образа
    k = np.random.randint(0, n_train - batch_size - 1)
    index = k + batch_size # берем выборку из batch_size значений
    Q = np.mean(loss(w, X_train[k:index], y_train[k:index])) # эмпирический риск
    Qe = lm * Q + (1 - lm) * Qe
    # обратить внимание - берется среднее значение по строкам
    grad_Q = df(w, X_train[k:index], y_train[k:index]).mean(axis=1)
    G = alpha * G + (1 - alpha) * grad_Q ** 2
    w = w - nt * grad_Q / (np.sqrt(G) + eps)

# доля неверных классификаций - расчет уже через скобки Айверсона
Q = (w @ X_train.T * y_train < 0).mean()

print(f"Q = {Q}")
print(f"Qe = {Qe}")

# построение графика
x_plot = np.linspace(min(data_x[:, 0]), max(data_x[:, 0]), 100)
y_plot = -x_plot * w[1] / w[2] - w[0] / w[2]

plt.plot(x_plot, y_plot, c='g')
plt.scatter(data_x[:, 0][data_y == 1], data_x[:, 1][data_y == 1],
            color='red', label='+1')
plt.scatter(data_x[:, 0][data_y == -1], data_x[:, 1][data_y == -1],
            color='blue', label='-1')
plt.title('Модель бинарной классификации')
plt.xlabel('Значения x1')
plt.ylabel('Значения x2')

plt.legend(loc='best')
plt.grid()
plt.show()