import numpy as np
import matplotlib.pyplot as plt

data_x = [(7.2, 2.5), (6.4, 2.2), (6.3, 1.5), (7.7, 2.2), (6.2, 1.8),
		  (5.7, 1.3), (7.1, 2.1), (5.8, 2.4), (5.2, 1.4), (5.9, 1.5),
		  (7.0, 1.4), (6.8, 2.1), (7.2, 1.6), (6.7, 2.4), (6.0, 1.5),
		  (5.1, 1.1), (6.6, 1.3), (6.1, 1.4), (6.7, 2.1), (6.4, 1.8),
		  (5.6, 1.3), (6.9, 2.3), (6.4, 1.9), (6.9, 2.3), (6.5, 2.2),
		  (6.0, 1.5), (5.6, 1.1), (5.6, 1.5), (6.0, 1.0), (6.0, 1.8),
		  (6.7, 2.5), (7.7, 2.3), (5.5, 1.1), (5.8, 1.0), (6.9, 2.1),
		  (6.6, 1.4), (6.3, 1.6), (6.1, 1.4), (5.0, 1.0), (7.7, 2.0),
		  (4.9, 1.7), (7.2, 1.8), (6.8, 1.4), (6.1, 1.2), (5.8, 1.9),
		  (6.3, 2.5), (5.7, 2.0), (6.5, 1.8), (7.6, 2.1), (6.3, 1.5),
		  (6.7, 1.4), (6.4, 2.3), (6.2, 2.3), (6.3, 1.9), (5.5, 1.3),
		  (7.9, 2.0), (6.7, 1.8), (6.4, 1.3), (6.5, 2.0), (6.5, 1.5),
		  (6.9, 1.5), (5.6, 1.3), (5.8, 1.2), (6.7, 2.3), (6.0, 1.6),
		  (5.7, 1.2), (5.7, 1.0), (5.5, 1.0), (6.1, 1.4), (6.3, 1.8),
		  (5.7, 1.3), (6.1, 1.3), (5.5, 1.3), (6.3, 1.3), (5.9, 1.8),
		  (7.7, 2.3), (6.5, 2.0), (5.6, 2.0), (6.7, 1.7), (5.7, 1.3),
		  (5.5, 1.2), (5.0, 1.0), (5.8, 1.9), (6.2, 1.3), (6.2, 1.5),
		  (6.3, 2.4), (6.4, 1.5), (7.4, 1.9), (6.8, 2.3), (5.6, 1.3),
		  (5.8, 1.2), (7.3, 1.8), (6.7, 1.5), (6.3, 1.8), (6.0, 1.6),
		  (6.4, 2.1), (6.1, 1.8), (5.9, 1.8), (5.4, 1.5), (4.9, 1.0)]
data_y = [1, 1, 1, 1, 1, -1, 1, 1, -1, -1, -1, 1, 1, 1, -1, -1, -1, 1, 1, 1, -1,
		  1, 1, 1, 1, 1, -1, -1, -1, 1, 1, 1, -1, -1, 1, -1, -1, -1, -1, 1, 1,
		  1, -1, -1, 1, 1, 1, 1, 1, -1, -1, 1, 1, 1, -1, 1, 1, -1, 1, -1, -1,
		  -1, -1, 1, -1, -1, -1, -1, -1, 1, -1, -1, -1, -1, 1, 1, 1, 1, -1, -1,
		  -1, -1, 1, -1, -1, 1, -1, 1, 1, -1, -1, 1, -1, 1, -1, 1, 1, -1, -1,
		  -1]

X_train = np.array(data_x)
y_train = np.array(data_y)

# мат. ожидания
mx11, mx12 = np.mean(X_train[y_train == -1], axis=0) # для класса -1
mx21, mx22 = np.mean(X_train[y_train == 1], axis=0) # для класса +1

# дисперсии - здесь рассчитывается смещенная дисперсия (несмещенную можно 
# задать через параметр ddof=1)
Dx11, Dx12 = np.var(X_train[y_train == -1], axis=0) # для класса -1
Dx21, Dx22 = np.var(X_train[y_train == 1], axis=0) # для класса +1

lm1 = 1 # штраф неверной классификации класса -1
lm2 = 1 # штраф неверной классификации класса +1
P1 = 0.5 # априорная вероятность появления образов класса -1
P2 = 1 - P1 # априорная вероятность появления образов класса +1

a1 = lambda x: np.log(lm1 * P1) - np.log(np.pi * np.sqrt(Dx11 * Dx12)) \
- (x[0] - mx11) ** 2 / (2 * Dx11) - (x[1] - mx12) ** 2 / (2 * Dx12)
a2 = lambda x: np.log(lm2 * P2) - np.log(np.pi * np.sqrt(Dx21 * Dx22)) \
- (x[0] - mx21) ** 2 / (2 * Dx21) - (x[1] - mx22) ** 2 / (2 * Dx22)

# пустой список под предсказания модели
predict = []
for x in X_train:
	# делаем прогноз для каждого образа, результатом должно быть -1 либо +1,
	# поэтому умножаем на 2 и вычитаем 1
	predict.append(np.argmax([a1(x), a2(x)]) * 2 - 1)

predict = np.array(predict)

Q = np.mean(predict != y_train) # доля ошибок

print(Q)

# построение графика
plt.scatter(X_train[:, 0][y_train == 1], X_train[:, 1][y_train == 1],
			label='+1')
plt.scatter(X_train[:, 0][y_train == -1], X_train[:, 1][y_train == -1],
			label='-1')

plt.grid()
plt.legend(loc='best')
plt.show()