import numpy as np
import matplotlib.pyplot as plt

# сигмоидная функция потерь
def loss(w, x, y):
    M = x @ w * y
    return 2 / (1 + np.exp(M))


# производная сигмоидной функции потерь по вектору w
def df(w, x, y):
    M = x @ w * y
    return -2 * np.exp(M) * x.T * y / (1 + np.exp(M)) ** 2


data_x = np.array([(5.8, 1.2), (5.6, 1.5), (6.5, 1.5), (6.1, 1.3), (6.4, 1.3),
                   (7.7, 2.0), (6.0, 1.8), (5.6, 1.3), (6.0, 1.6), (5.8, 1.9),
                   (5.7, 2.0), (6.3, 1.5), (6.2, 1.8), (7.7, 2.3), (5.8, 1.2),
                   (6.3, 1.8), (6.0, 1.0), (6.2, 1.3), (5.7, 1.3), (6.3, 1.9),
                   (6.7, 2.5), (5.5, 1.2), (4.9, 1.0), (6.1, 1.4), (6.0, 1.6),
                   (7.2, 2.5), (7.3, 1.8), (6.6, 1.4), (5.6, 2.0), (5.5, 1.0),
                   (6.4, 2.2), (5.6, 1.3), (6.6, 1.3), (6.9, 2.1), (6.8, 2.1),
                   (5.7, 1.3), (7.0, 1.4), (6.1, 1.4), (6.1, 1.8), (6.7, 1.7),
                   (6.0, 1.5), (6.5, 1.8), (6.4, 1.5), (6.9, 1.5), (5.6, 1.3),
                   (6.7, 1.4), (5.8, 1.9), (6.3, 1.3), (6.7, 2.1), (6.2, 2.3),
                   (6.3, 2.4), (6.7, 1.8), (6.4, 2.3), (6.2, 1.5), (6.1, 1.4),
                   (7.1, 2.1), (5.7, 1.0), (6.8, 1.4), (6.8, 2.3), (5.1, 1.1),
                   (4.9, 1.7), (5.9, 1.8), (7.4, 1.9), (6.5, 2.0), (6.7, 1.5),
                   (6.5, 2.0), (5.8, 1.0), (6.4, 2.1), (7.6, 2.1), (5.8, 2.4),
                   (7.7, 2.2), (6.3, 1.5), (5.0, 1.0), (6.3, 1.6), (7.7, 2.3),
                   (6.4, 1.9), (6.5, 2.2), (5.7, 1.2), (6.9, 2.3), (5.7, 1.3),
                   (6.1, 1.2), (5.4, 1.5), (5.2, 1.4), (6.7, 2.3), (7.9, 2.0),
                   (5.6, 1.1), (7.2, 1.8), (5.5, 1.3), (7.2, 1.6), (6.3, 2.5),
                   (6.3, 1.8), (6.7, 2.4), (5.0, 1.0), (6.4, 1.8), (6.9, 2.3),
                   (5.5, 1.3), (5.5, 1.1), (5.9, 1.5), (6.0, 1.5), (5.9, 1.8)])
data_y = np.array([-1, -1, -1, -1, -1, 1, 1, -1, -1, 1, 1, -1, 1, 1, -1, 1, -1,
                   -1, -1, 1, 1, -1, -1, -1, -1, 1, 1, -1, 1, -1, 1, -1, -1, 1,
                   1, -1, -1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1, -1, 1, 1, 1, 1,
                   1, -1, -1, 1, -1, -1, 1, -1, 1, -1, 1, 1, -1, 1, -1, 1, 1, 1,
                   1, 1, -1, -1, 1, 1, 1, -1, 1, -1, -1, -1, -1, 1, 1, -1, 1,
                   -1, 1, 1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1])

x_train = np.array([[1, x[0], x[1]] for x in data_x]) # матрица признаков
y_train = data_y # целевые значения

n_train = len(x_train) # размер обучающей выборки
w = [0.0, 0.0, 0.0] # начальные весовые коэффициенты
nt = np.array([1, 0.1, 0.1]) # шаг обучения для каждого параметра w0, w1, w2
lm = 0.01 # значение параметра лямбда для вычисления EMA
N = 500 # число итераций алгоритма SGD
batch_size = 10 # размер мини-батча (величина K = 10)

# начальное значение среднего эмпирического риска
Qe = (x_train @ w * y_train < 0).sum() 
np.random.seed(0)

for i in range(N):
    k = np.random.randint(0, n_train - batch_size - 1)
    x_k = x_train[k:k + batch_size]
    y_k = y_train[k:k + batch_size]
    Q = np.mean(loss(w, x_k, y_k))
    Qe = lm * Q + (1 - lm) * Qe
    dQ = np.mean(df(w, x_k, y_k), axis=1)
    w = w - nt * dQ

Q = (x_train @ w * y_train < 0).sum()

print(f"Q = {Q}")
print(f"Qe = {Qe}")

# построение графика
x_plot = np.linspace(min(x_train[:, 1]), max(x_train[:, 1]), 100)
y_plot = - w[0] / w[2] - w[1] * x_plot / w[2]
plt.scatter(data_x[:, 0][y_train == 1], data_x[:, 1][y_train == 1],
            color='red', label='+1')
plt.scatter(data_x[:, 0][y_train == -1], data_x[:, 1][y_train == -1],
            color='blue', label='-1')
plt.plot(x_plot, y_plot, color='green') # разделяющая линия

plt.grid()
plt.legend(loc='best')
plt.show()