import numpy as np
import matplotlib.pyplot as plt
from sklearn import svm

data_x = np.array([(3.0, 4.9), (2.7, 3.9), (3.0, 5.5), (2.6, 4.0), (2.9, 4.3),
				   (3.1, 5.1), (2.2, 4.5), (2.3, 3.3), (2.7, 5.1), (3.3, 5.7),
				   (2.8, 5.1), (2.8, 4.9), (2.5, 4.5), (2.8, 4.7), (3.2, 4.7),
				   (3.2, 5.7), (2.8, 6.1), (3.6, 6.1), (2.8, 4.8), (2.9, 4.5),
				   (3.1, 4.9), (2.3, 4.4), (3.3, 6.0), (2.6, 5.6), (3.0, 4.4),
				   (2.9, 4.7), (2.8, 4.0), (2.5, 5.8), (2.4, 3.3), (2.8, 6.7),
				   (3.0, 5.1), (2.3, 4.0), (3.1, 5.5), (2.8, 4.8), (2.7, 5.1),
				   (2.5, 4.0), (3.1, 4.4), (3.8, 6.7), (3.1, 5.6), (3.1, 4.7),
				   (3.0, 5.8), (3.0, 5.2), (3.0, 4.5), (2.7, 4.9), (3.0, 6.6),
				   (2.9, 4.6), (3.0, 4.6), (2.6, 3.5), (2.7, 5.1), (2.5, 5.0),
				   (2.0, 3.5), (3.2, 5.9), (2.5, 5.0), (3.4, 5.6), (3.4, 4.5),
				   (3.2, 5.3), (2.2, 4.0), (2.2, 5.0), (3.3, 4.7), (2.7, 4.1),
				   (2.4, 3.7), (3.0, 4.2), (3.2, 6.0), (3.0, 4.2), (3.0, 4.5),
				   (2.7, 4.2), (2.5, 3.0), (2.8, 4.6), (2.9, 4.2), (3.1, 5.4),
				   (2.5, 4.9), (3.2, 5.1), (2.8, 4.5), (2.8, 5.6), (3.4, 5.4),
				   (2.7, 3.9), (3.0, 6.1), (3.0, 5.8), (3.0, 4.1), (2.5, 3.9),
				   (2.4, 3.8), (2.6, 4.4), (2.9, 3.6), (3.3, 5.7), (2.9, 5.6),
				   (3.0, 5.2), (3.0, 4.8), (2.7, 5.3), (2.8, 4.1), (2.8, 5.6),
				   (3.2, 4.5), (3.0, 5.9), (2.9, 4.3), (2.6, 6.9), (2.8, 5.1),
				   (2.9, 6.3), (3.2, 4.8), (3.0, 5.5), (3.0, 5.0), (3.8, 6.4)])
data_y = np.array([1, -1, 1, -1, -1, 1, -1, -1, -1, 1, 1, 1, 1, -1, -1, 1, 1, 1,
				   -1, -1, -1, -1, 1, 1, -1, -1, -1, 1, -1, 1, 1, -1, 1, 1, 1,
				   -1, -1, 1, 1, -1, 1, 1, -1, 1, 1, -1, -1, -1, 1, 1, -1, 1, 1,
				   1, -1, 1, -1, 1, -1, -1, -1, -1, 1, -1, -1, -1, -1, -1, -1,
				   1, -1, 1, -1, 1, 1, -1, 1, 1, -1, -1, -1, -1, -1, 1, 1, 1, 1,
				   1, -1, 1, -1, 1, -1, 1, 1, 1, -1, 1, -1, 1])

# обучающая выборка в формате [1, x1, x2]
X_train = np.array([[1] + list(x) for x in data_x]) # входные образы
y_train = data_y # целевые значения (метки классов)

clf = svm.SVC(kernel='linear') # SVM с линейным ядром
# нахождение вектора w по обучающей выборке - используются не X_train и 
# y_train, а data_x и data_y
clf.fit(data_x, data_y)

w12 = clf.coef_[0] # коэффициенты w1, w2 разделяющей гиперплоскости
intercept = clf.intercept_[0] # коэффициент w0 разделяющей гиперплоскости
v_support = clf.support_vectors_ # список опорных векторов

print(w12)
print(intercept)
print(v_support)
print(clf.classes_) # уникальные метки классов

# сформируем массив всех коэффициентов с учетом w0
w = np.hstack((intercept, w12))
Q = (np.sign(X_train @ w) != y_train).sum() # количество неверных классификаций
print(Q) # странно, что метод predict дает другие результаты

# построение графика
x_plot = np.linspace(min(data_x[:, 0]), max(data_x[:, 0]), 100)
y_plot = - w[1] / w[2] * x_plot - w[0] / w[2] # уравнение разделяющей прямой

plt.plot(x_plot, y_plot, linestyle='--', color='green')
plt.scatter(data_x[:, 0][data_y == -1], data_x[:, 1][data_y == -1], color='red',
			label='-1')
plt.scatter(data_x[:, 0][data_y == 1], data_x[:, 1][data_y == 1], color='blue',
			label='+1')
plt.scatter(data_x[np.sign(X_train @ w) != y_train][:, 0],
			data_x[np.sign(X_train @ w) != y_train][:, 1], color='black', 
			marker='x', label='mistakes') # неверно классифицированные образы

plt.title('Применение SVM')
plt.xlabel('Значение x1')
plt.ylabel('Значение x2')
plt.grid()
plt.legend(loc='best')
plt.show()