import numpy as np
import matplotlib.pyplot as plt
from sklearn import svm

data_x = np.array([(4.9, 3.3), (5.6, 4.5), (6.4, 4.3), (6.7, 5.7), (6.3, 5.0),
				   (5.2, 3.9), (5.5, 3.7), (5.6, 3.6), (5.5, 3.8), (6.1, 4.7),
				   (7.4, 6.1), (6.0, 5.1), (5.5, 4.4), (5.9, 5.1), (6.5, 5.8),
				   (6.5, 4.6), (6.7, 4.4), (6.3, 5.6), (5.9, 4.8), (6.0, 4.5),
				   (5.6, 4.1), (5.6, 4.9), (4.9, 4.5), (6.2, 4.5), (6.1, 4.7),
				   (6.1, 4.9), (6.2, 5.4), (5.7, 4.2), (6.1, 5.6), (5.8, 4.0),
				   (6.6, 4.6), (5.6, 4.2), (7.2, 6.1), (7.7, 6.7), (5.6, 3.9),
				   (7.7, 6.9), (6.0, 4.0), (6.1, 4.0), (7.6, 6.6), (5.1, 3.0),
				   (6.3, 6.0), (6.7, 5.7), (6.8, 5.9), (6.4, 5.5), (7.0, 4.7),
				   (5.8, 5.1), (5.8, 5.1), (6.4, 5.3), (6.3, 4.9), (6.4, 5.3),
				   (5.7, 3.5), (7.2, 5.8), (6.4, 5.6), (5.7, 4.5), (6.0, 4.5),
				   (7.7, 6.1), (6.2, 4.3), (7.1, 5.9), (7.3, 6.3), (5.0, 3.3),
				   (6.3, 5.1), (5.8, 3.9), (6.4, 4.5), (6.3, 5.6), (6.8, 5.5),
				   (6.9, 5.4), (5.5, 4.0), (5.7, 4.1), (6.5, 5.5), (6.3, 4.7),
				   (5.0, 3.5), (6.7, 5.8), (6.9, 4.9), (7.7, 6.7), (5.8, 4.1),
				   (6.4, 5.6), (6.7, 5.2), (6.7, 4.7), (5.4, 4.5), (6.8, 4.8),
				   (5.7, 4.2), (5.5, 4.0), (6.3, 4.9), (6.5, 5.2), (5.8, 5.1),
				   (6.0, 4.8), (6.2, 4.8), (6.5, 5.1), (7.9, 6.4), (6.7, 5.0),
				   (6.7, 5.6), (6.0, 5.0), (6.1, 4.6), (5.7, 5.0), (7.2, 6.0),
				   (6.3, 4.4), (5.9, 4.2), (6.9, 5.1), (6.6, 4.4), (6.9, 5.7)])
data_y = np.array([-1, -1, -1, 1, 1, -1, -1, -1, -1, -1, 1, -1, -1, 1, 1, -1,
				   -1, 1, -1, -1, -1, 1, 1, -1, -1, 1, 1, -1, 1, -1, -1, -1, 1,
				   1, -1, 1, -1, -1, 1, -1, 1, 1, 1, 1, -1, 1, 1, 1, 1, 1, -1,
				   1, 1, -1, -1, 1, -1, 1, 1, -1, 1, -1, -1, 1, 1, 1, -1, -1, 1,
				   -1, -1, 1, -1, 1, -1, 1, 1, -1, -1, -1, -1, -1, -1, 1, 1, 1,
				   1, 1, 1, -1, 1, 1, -1, 1, 1, -1, -1, 1, -1, 1])

# обучающая выборка в формате [1, x1, x2]
X_train = np.array([[1] + list(x) for x in data_x]) # входные образы
y_train = data_y # целевые значения (метки классов)

clf = svm.LinearSVC() # SVM для линейно разделимой выборки
clf.fit(X_train, y_train) # нахождение вектора w по обучающей выборке

w = clf.coef_[0] # коэффициенты линейной модели
# x2 = -w1 / w2 * x1 - w0 / w2,  _coef[0] возвращает значение w0 / w2, 
# отсюда вычисляем w0 = _coef[0] * w2 (особенности sklearn)
w[0] = w[0] * w[2]

print(w) # полученные коэффициенты модели
print(clf.intercept_) # параметр intercept (свободный член)
print(clf.classes_) # уникальные метки классов

Q = (np.sign(X_train @ w) != y_train).sum() # количество неверных классификаций
print(Q) # странно, что метод predict дает другие результаты

# построение графика
x_plot = np.linspace(min(data_x[:, 0]), max(data_x[:, 0]), 100)
y_plot = - w[1] / w[2] * x_plot - w[0] / w[2] # уравнение разделяющей прямой

plt.plot(x_plot, y_plot, linestyle='--', color='green')
plt.scatter(data_x[:, 0][data_y == -1], data_x[:, 1][data_y == -1], color='red',
			label='-1')
plt.scatter(data_x[:, 0][data_y == 1], data_x[:, 1][data_y == 1], color='blue',
			label='+1')
plt.scatter(data_x[np.sign(X_train @ w) != y_train][:, 0],
			data_x[np.sign(X_train @ w) != y_train][:, 1], color='black', 
			marker='x', label='mistakes') # неверно классифицированные образы

plt.title('Применение SVM')
plt.xlabel('Значение x1')
plt.ylabel('Значение x2')
plt.grid()
plt.legend(loc='best')
plt.show()