import numpy as np
import matplotlib.pyplot as plt

# логарифмическая функция потерь
def loss(w, x, y):
    M = np.dot(w, x) * y
    return np.log2(1 + np.exp(-M))


# производная логарифмической функции потерь по вектору w
def df(w, x, y):
    M = np.dot(w, x) * y
    return -(np.exp(-M) * x.T * y) / ((1 + np.exp(-M)) * np.log(2))


data_x = np.array([(5.8, 1.2), (5.6, 1.5), (6.5, 1.5), (6.1, 1.3), (6.4, 1.3),
                   (7.7, 2.0), (6.0, 1.8), (5.6, 1.3), (6.0, 1.6), (5.8, 1.9),
                   (5.7, 2.0), (6.3, 1.5), (6.2, 1.8), (7.7, 2.3), (5.8, 1.2),
                   (6.3, 1.8), (6.0, 1.0), (6.2, 1.3), (5.7, 1.3), (6.3, 1.9),
                   (6.7, 2.5), (5.5, 1.2), (4.9, 1.0), (6.1, 1.4), (6.0, 1.6),
                   (7.2, 2.5), (7.3, 1.8), (6.6, 1.4), (5.6, 2.0), (5.5, 1.0),
                   (6.4, 2.2), (5.6, 1.3), (6.6, 1.3), (6.9, 2.1), (6.8, 2.1),
                   (5.7, 1.3), (7.0, 1.4), (6.1, 1.4), (6.1, 1.8), (6.7, 1.7),
                   (6.0, 1.5), (6.5, 1.8), (6.4, 1.5), (6.9, 1.5), (5.6, 1.3),
                   (6.7, 1.4), (5.8, 1.9), (6.3, 1.3), (6.7, 2.1), (6.2, 2.3),
                   (6.3, 2.4), (6.7, 1.8), (6.4, 2.3), (6.2, 1.5), (6.1, 1.4),
                   (7.1, 2.1), (5.7, 1.0), (6.8, 1.4), (6.8, 2.3), (5.1, 1.1),
                   (4.9, 1.7), (5.9, 1.8), (7.4, 1.9), (6.5, 2.0), (6.7, 1.5),
                   (6.5, 2.0), (5.8, 1.0), (6.4, 2.1), (7.6, 2.1), (5.8, 2.4),
                   (7.7, 2.2), (6.3, 1.5), (5.0, 1.0), (6.3, 1.6), (7.7, 2.3),
                   (6.4, 1.9), (6.5, 2.2), (5.7, 1.2), (6.9, 2.3), (5.7, 1.3),
                   (6.1, 1.2), (5.4, 1.5), (5.2, 1.4), (6.7, 2.3), (7.9, 2.0),
                   (5.6, 1.1), (7.2, 1.8), (5.5, 1.3), (7.2, 1.6), (6.3, 2.5),
                   (6.3, 1.8), (6.7, 2.4), (5.0, 1.0), (6.4, 1.8), (6.9, 2.3),
                   (5.5, 1.3), (5.5, 1.1), (5.9, 1.5), (6.0, 1.5), (5.9, 1.8)])
data_y = np.array([-1, -1, -1, -1, -1, 1, 1, -1, -1, 1, 1, -1, 1, 1, -1, 1, -1,
                   -1, -1, 1, 1, -1, -1, -1, -1, 1, 1, -1, 1, -1, 1, -1, -1, 1,
                   1, -1, -1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1, -1, 1, 1, 1, 1,
                   1, -1, -1, 1, -1, -1, 1, -1, 1, -1, 1, 1, -1, 1, -1, 1, 1, 1,
                   1, 1, -1, -1, 1, 1, 1, -1, 1, -1, -1, -1, -1, 1, 1, -1, 1,
                   -1, 1, 1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1])

X_train = np.array([[1, x[0], x[1]] for x in data_x]) # матрица признаков
y_train = data_y # целевые значения

n_train = len(X_train) # размер обучающей выборки
w = [0.0, 0.0, 0.0] # начальные весовые коэффициенты
nt = np.array([0.5, 0.01, 0.01]) # шаг обучения для каждого параметра w0, w1, w2
N = 500 # число итераций алгоритма SGD

np.random.seed(0)

for i in range(N):
    k = np.random.randint(0, n_train - 1) # индекс случайного образа
    grad_L = df(w, X_train[k], y_train[k])
    w = w - nt * grad_L

predict = np.sign(X_train @ w) # выход классификатора
TP = np.sum((predict == +1) & (predict == y_train)) # true positive
TN = np.sum((predict == -1) & (predict == y_train)) # true negative
FP = np.sum((predict == +1) & (predict != y_train)) # false positive
FN = np.sum((predict == -1) & (predict != y_train)) # false negative
precision = TP / (TP + FP) # метрика precision
recall = TP / (TP + FN) # метрика recall

print(precision)
print(recall)

# построение графика
x_plot = np.linspace(min(data_x[:, 0]), max(data_x[:, 0]), 100)
y_plot = - w[1] / w[2] * x_plot - w[0] / w[2] # уравнение разделяющей прямой

plt.plot(x_plot, y_plot, linestyle='--', color='green')
plt.scatter(data_x[:, 0][data_y == 1], data_x[:, 1][data_y == 1],
            color='red', label='+1')
plt.scatter(data_x[:, 0][data_y == -1], data_x[:, 1][data_y == -1],
            color='blue', label='-1')
plt.title('Модель бинарной классификации')
plt.xlabel('Значения x1')
plt.ylabel('Значения x2')

plt.legend(loc='best')
plt.grid()
plt.show()