import numpy as np
import matplotlib.pyplot as plt
from sklearn.cluster import DBSCAN

X = np.array([(58, 138), (74, 96), (103, 82), (135, 76), (162, 79), (184, 97),
			  (206, 111), (231, 118), (251, 118),  (275, 110), (298, 86),
			  (320, 68), (344, 62), (376, 61), (403, 75), (414, 90), (430, 100),
			  (254, 80), (219, 85), (288, 66), (260, 92), (201, 76), (162, 66),
			  (127, 135), (97, 143), (83, 160), (82, 177), (88, 199),
			  (105, 205), (135, 208), (151, 198), (157, 169), (153, 152),
			  (117, 158), (106, 168), (106, 185), (123, 188), (125, 171),
			  (139, 163), (139, 183), (358, 127), (328, 132), (313, 146),
			  (300, 169), (300, 181), (308, 197), (326, 206), (339, 209),
			  (370, 199), (380, 184), (380, 147), (343, 154), (329, 169),
			  (332, 184), (345, 185), (363, 159), (361, 177), (344, 169),
			  (311, 175), (351, 89), (134, 96)])

# параметры подобраны перебором, чтобы не было шумовых объектов
clustering = DBSCAN(eps=35, min_samples=3, metric='euclidean')
# полученные метки кластеров, (-1) - шумовые объекты
res = clustering.fit_predict(X)
# также можно получить метки кластеров через атрибут labels_

# выделим образы разных кластеров для построения графика
X1 = X[res == 0]
X2 = X[res == 1]
X3 = X[res == 2]
Noise = X[res == -1]

print(clustering.labels_)

# построение графика
plt.scatter(X1[:, 0], X1[:, 1], color='red')
plt.scatter(X2[:, 0], X2[:, 1], color='blue')
plt.scatter(X3[:, 0], X3[:, 1], color='green')
plt.scatter(Noise[:, 0], Noise[:, 1], color='yellow')
plt.title('Применение DBSCAN')
plt.xlabel('Значение x1')
plt.ylabel('Значение x2')

plt.grid()
plt.show()