import numpy as np
import matplotlib.pyplot as plt
from sklearn.cluster import DBSCAN

X = np.array(
    [
        (166, 88),
        (147, 119),
        (133, 147),
        (113, 175),
        (91, 92),
        (120, 126),
        (146, 151),
        (172, 174),
        (94, 192),
        (187, 193),
        (328, 82),
        (299, 97),
        (277, 131),
        (280, 171),
        (299, 198),
        (348, 194),
        (378, 153),
        (372, 95),
        (222, 169),
        (332, 141),
        (69, 256),
        (110, 258),
        (139, 257),
        (179, 256),
        (210, 256),
        (248, 256),
        (295, 256),
        (322, 254),
        (350, 252),
        (377, 251),
        (400, 247),
        (403, 260),
        (378, 278),
        (341, 273),
        (306, 274),
        (277, 275),
        (245, 274),
        (222, 275),
        (193, 276),
        (170, 276),
        (147, 279),
        (120, 274),
        (91, 275),
        (65, 279),
    ]
)

clustering = DBSCAN(eps=55, min_samples=3, metric="euclidean")
# полученные метки кластеров, (-1) - шумовые объекты
res = clustering.fit_predict(X)
# также можно получить метки кластеров через атрибут labels_

# выделим образы разных кластеров по условию задачи
X1 = X[res == 0]
X2 = X[res == 1]
X3 = X[res == 2]
Noise = X[res == -1]

# построение графика
plt.scatter(X1[:, 0], X1[:, 1], color="red")
plt.scatter(X2[:, 0], X2[:, 1], color="blue")
plt.scatter(X3[:, 0], X3[:, 1], color="green")
plt.scatter(Noise[:, 0], Noise[:, 1], color="yellow")
plt.title("Применение DBSCAN")
plt.xlabel("Значение x1")
plt.ylabel("Значение x2")

plt.grid()
plt.show()