import numpy as np
import matplotlib.pyplot as plt
from sklearn import tree

X = np.array([(300, 200), (320, 180), (400, 100), (430, 65), (64, 150),
			  (84, 112), (106, 90), (154, 64), (192, 62), (220, 82), (244, 92),
			  (271, 111), (275, 137), (286, 161), (56, 178), (80, 156),
			  (101, 131), (123, 104), (155, 94), (191, 100), (242, 70),
			  (231, 114), (272, 95), (261, 131), (299, 136), (308, 124),
			  (128, 78), (47, 128), (47, 159), (137, 186), (166, 228),
			  (171, 250), (194, 272), (221, 287), (253, 292), (308, 293),
			  (332, 280), (385, 256), (398, 237), (413, 205), (435, 166),
			  (447, 137), (422, 126), (400, 154), (389, 183), (374, 214),
			  (358, 235), (321, 250), (274, 263), (249, 263), (208, 230),
			  (192, 204), (182, 174), (147, 205), (136, 246), (147, 255),
			  (182, 282), (204, 298), (252, 316), (312, 321), (349, 313),
			  (393, 288), (417, 259), (434, 222), (443, 187), (463, 174),
			  (420, 90)])
y = np.array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
			  0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
			  1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
			  1, 1])

clf = tree.DecisionTreeClassifier(criterion='gini', max_depth=4)
clf.fit(X, y)
predict = clf.predict(X) # делаем прогноз

Q = np.mean(predict == y) # метрика accuracy

print(Q)
print(clf.score(X, y)) # то же самое можно рассчитать через метод score класса

# построение графика
fig, ax = plt.subplots(1, 2, figsize=(12, 7))
# класс 0
ax[0].scatter(X[:, 0][predict == 0], X[:, 1][predict == 0], color='red',
			  label='class 0')
# класс 1
ax[0].scatter(X[:, 0][predict == 1], X[:, 1][predict == 1], color='blue',
			  label='class 1')
ax[0].set_xlabel('Значение x1')
ax[0].set_ylabel('Значение x2')
ax[0].legend(loc='best')
ax[0].grid()

ax[1].plot = tree.plot_tree(clf) # визуализация дерева

plt.show()